{"flavors":[{"title":"Andes Mint Avalanche","description":"Mint Fresh Frozen Custard with Andes Mint pieces and chocolate."},{"title":"Blackberry Cobbler","description":"Blackberry Fresh Frozen Custard with pie crust pieces."},{"title":"Brownie Thunder","description":"Chocolate Fresh Frozen Custard with brownie pieces and marshmallow."},{"title":"Butter Pecan","description":"Butter Pecan Fresh Frozen Custard."},{"title":"Caramel Cashew","description":"Vanilla Fresh Frozen Custard with caramel and cashew pieces."},{"title":"Caramel Chocolate Pecan","description":"Delicious Chocolate Fresh Frozen Custard enhanced with ribbons of old fashioned salted caramel, toasted pecan pieces and chopped Dove Chocolate pieces."},{"title":"Caramel Fudge Cookie Dough","description":"Vanilla Fresh Frozen Custard with caramel, fudge, and cookie dough."},{"title":"Caramel Peanut Buttercup","description":"Creamy Vanilla Fresh Frozen Custard swirled with ribbons of peanut butter and old fashioned salted caramel and loaded with novelty chocolate."},{"title":"Caramel Pecan","description":"Caramel Fresh Frozen Custard with pecan pieces."},{"title":"Caramel Turtle","description":"Caramel Fresh Frozen Custard with pecan pieces and fudge."},{"title":"Chocolate Caramel Twist","description":"Chocolate and Vanilla Fresh Frozen Custard with caramel."},{"title":"Chocolate Covered Strawberry","description":"Our creamy Vanilla Fresh Frozen Custard complemented with plump strawberries and novelty chocolate."},{"title":"Chocolate Heath Crunch","description":"Chocolate Fresh Frozen Custard with Heath bar pieces."},{"title":"Chocolate Oreo Volcano","description":"Chocolate Fresh Frozen Custard with OREO cookie pieces and marshmallow."},{"title":"Chocolate Volcano","description":"Chocolate Fresh Frozen Custard with fudge and marshmallow."},{"title":"Crazy for Cookie Dough","description":"Vanilla Fresh Frozen Custard with cookie dough pieces and fudge."},{"title":"Dark Chocolate Decadence","description":"Dark Chocolate Fresh Frozen Custard with fudge and chocolate chips."},{"title":"Dark Chocolate PB Crunch","description":"Dark Chocolate Fresh Frozen Custard with peanut butter and chocolate crunch."},{"title":"Devil's Food Cake","description":"Dark Chocolate Fresh Frozen Custard swirled with chocolate cake and novelty chocolate."},{"title":"Double Strawberry","description":"Our specially blended Strawberry Fresh Frozen Custard swirled with plump strawberries."},{"title":"Georgia Peach","description":"Our specially blended Peach Fresh Frozen Custard swirled with sweet peaches for a light, refreshing treat."},{"title":"Georgia Peach Pecan","description":"Peach Fresh Frozen Custard with pecan pieces."},{"title":"Lemon Berry Layer Cake","description":"Lemon Fresh Frozen Custard with blueberries and cake pieces."},{"title":"Lemon Dash Cookie","description":"Lemon Fresh Frozen Custard with cookie pieces."},{"title":"Mint Cookie","description":"Mint Fresh Frozen Custard with cookie pieces."},{"title":"Mint Explosion","description":"Mint Fresh Frozen Custard with OREO cookie pieces and fudge."},{"title":"OREO Cheesecake","description":"Cheesecake Fresh Frozen Custard with OREO cookie pieces."},{"title":"OREO Cookie Cheesecake","description":"Cheesecake Fresh Frozen Custard with OREO cookie pieces."},{"title":"OREO Cookies and Cream","description":"Vanilla Fresh Frozen Custard with OREO cookie pieces."},{"title":"Peanut Butter Cup","description":"Chocolate Fresh Frozen Custard with peanut butter cup pieces."},{"title":"Raspberry Cheesecake","description":"Cheesecake Fresh Frozen Custard with raspberry sauce."},{"title":"Really Reese's","description":"Chocolate Fresh Frozen Custard with Reese's peanut butter cup pieces."},{"title":"Salted Caramel Pecan Pie","description":"Salted Caramel Fresh Frozen Custard with pecan pie pieces."},{"title":"Salted Double Caramel Pecan","description":"Ribbons of old fashioned salted caramel swirled into Caramel Fresh Frozen Custard and mixed with toasted pecan pieces."},{"title":"Snickers Swirl","description":"Chocolate Fresh Frozen Custard with Snickers bar pieces and caramel."},{"title":"Strawberry Cheesecake","description":"Cheesecake Fresh Frozen Custard with strawberry sauce."},{"title":"Turtle","description":"Vanilla Fresh Frozen Custard with pecan pieces, caramel, and fudge."},{"title":"Turtle Cheesecake","description":"Cheesecake Fresh Frozen Custard with pecan pieces, caramel, and fudge."},{"title":"Turtle Dove","description":"Chocolate and Vanilla Fresh Frozen Custard with pecan pieces, caramel, and fudge."},{"title":"Vanilla","description":"Vanilla Fresh Frozen Custard."}],"updatedAt":"2026-02-22T20:15:36.901Z"}